def main () :
    talk = float(input("Напишите количество израсходованных за месяц минут разговора : "))
    sms = float(input("Напишите количество израсходованных за месяц смс-сообщений : "))
    inet = float(input("Напишите количество израсходованных за месяц гигабайт трафика : "))
    print("Базовая месячная тарификация за 24.99 рублей : ")
    print(" 60 минут разговоров")
    print(" 30 смс сообщений")
    print("1ГБ интернет-трафика")
    sum = 24.99
    if talk >  60 :
        print(f"Сумма за доп.минуты разговора : {(talk - 60) * 0.89 }")
        sum += (talk - 60) * 0.89

    if sms >  30 :
        print(f"Сумма за доп.сообщения  : {round((sms - 30) * 0.59,2)}")
        sum += (sms - 30) * 0.59

    if inet >  1 :
        print(f"Сумма за доп.гигабайты интернета  : {(inet - 1) * 0.79}")
        sum += (inet - 1) * 0.79 
 
    tax = sum* 0.02
    rsum = (sum,2)
    rtax = round(tax,2)
    print(f"Налог : { rtax }") 
    sumtax = sum + tax
    print(f"Сумма к оплате с учетом налога : { round(sumtax,2) }")


main()


    